
// { Plugin interface
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Тип", ВозможныеТипыПлагинов.Утилита);
	Результат.Вставить("Идентификатор", Метаданные().Имя);
	Результат.Вставить("Представление", "ВспомогательныеУтилиты");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
КонецФункции

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
КонецПроцедуры
// } Plugin interface

/////////////////////////////////////////////////////////////////////////
// Программный интерфейс

// Вызывает задержку вызова кода.
//
// Параметры:
//  Время - Число - сколько секунд длится задержка.
//
Процедура Пауза(Время) Экспорт

	ВремяЗавершения = ТекущаяДата() + Время;
	Пока ТекущаяДата() < ВремяЗавершения Цикл
	КонецЦикла;

КонецПроцедуры

// Сообщения пользователю, которые не были показаны одной строкой.
// 
// Возвращаемое значение:
//  Строка - текст сообщений.
//
Функция СообщенияПользователюВСтроку() Экспорт
	
	СообщенияПользователю = ПолучитьСообщенияПользователю();
	
	Если СообщенияПользователю.Количество()=0 Тогда
		Возврат "";
	КонецЕсли;
	
	Массив = Новый Массив;
	Для Каждого Сообщение Из СообщенияПользователю Цикл
		Массив.Добавить(Сообщение.Текст);
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, Символы.ПС);
	
КонецФункции